'''
온톨로지 구성요소
1. 클래스
    - 개념이나 사물의 종류를 정의하는 추상적 집합
    - '사람', '남자', '여자' 와 같은 개념 종류
2. 인스턴스
    - 클래스에 속하는 실제적인 개체
    - '홍길동', '성춘향' 과 같은 실제 인물
3. 속성
    - 인스턴스가 가지는 특징이나 값을 표현
    - '홍길동' 의 '나이: 25세', '직업: 학생'
4. 관계
    - 인스턴스나 클래스 간의 연결과 상호작용
    - '홍길동'은 '성춘향'과 친구이다
5. 공리
    - 반드시 참이 되는 규칙이나 제약 조건
    - '모든 남자는 사람이다', '부모의 부모는 조부모이다'


위 5가지 구성 요소들이 연결되어 지식 체계를 구축하고 기계가 새로운 사실을 추론할 수 있는 기반이 된다.
DMBS : 데이터의 구조를 정의 (Structure), 데이터 저장과 검색에 최적화
Ontology : 데이터의 의미를 정의 (Semantics), 추론과 지식 확장에 최적화
Graph DB : 온톨로지를 실용적으로 조정, 속성 정보를 추가하여 관계의 규모를 줄임

TBOX : 설계도 (클래스, 속성 / 이것이 무엇을 뜻하는가?)
ABOX : 실제 데이터 (인스턴스, 값 / 누구와 누구가 어떻게 연결되어 있는가?)

온톨로지는 TBOX 와 ABOX 를 둘다 다루고, 그래프DB는 TBOX 를 최소화하고 ABOX 탐색에 집중한다.
의도 (질문) -> TBox (설계도) -> ABox (실체)
질문이 설계를 이끈다
'''
